bouffalolab/bl_iot_sdk-components/platform/soc/bl702l/bl702l_std/BSP_Driver/std_drv/src/bl702l_dma.c
/** @defgroup  DMA_Public_Functions
 *  @{
 */

/****************************************************************************/ /**
 * @brief  DMA enable
 *
 * @param  dmaId: DMA ID type
 *
 * @return None
 *
*******************************************************************************/
void DMA_Enable(DMA_ID_Type dmaId)
{
    uint32_t tmpVal;
    /* Get DMA register */
    uint32_t DMAChs = dmaAddr[dmaId];

    /* Check the parameters */
    CHECK_PARAM(IS_DMA_ID_TYPE(dmaId));

    tmpVal = BL_RD_REG(DMAChs, DMA_TOP_CONFIG);
    tmpVal = BL_SET_REG_BIT(tmpVal, DMA_E);
    BL_WR_REG(DMAChs, DMA_TOP_CONFIG, tmpVal);
#ifndef BFLB_USE_HAL_DRIVER
    Interrupt_Handler_Register(DMA_ALL_IRQn, DMA0_ALL_IRQHandler);
#endif
}

/****************************************************************************/ /**
 * @brief  DMA disable
 *
 * @param  dmaId: DMA ID type
 *
 * @return None
 *
*******************************************************************************/
void DMA_Disable(DMA_ID_Type dmaId)
{
    uint32_t tmpVal;
    /* Get DMA register */
    uint32_t DMAChs = dmaAddr[dmaId];

    /* Check the parameters */
    CHECK_PARAM(IS_DMA_ID_TYPE(dmaId));

    tmpVal = BL_RD_REG(DMAChs, DMA_TOP_CONFIG);
    tmpVal = BL_CLR_REG_BIT(tmpVal, DMA_E);
    BL_WR_REG(DMAChs, DMA_TOP_CONFIG, tmpVal);
}

/****************************************************************************/ /**
 * @brief  DMA channel init
 *
 * @param  dmaId: DMA ID type
 * @param  chCfg: DMA configuration
 *
 * @return None
 *
*******************************************************************************/
void DMA_Channel_Init(DMA_ID_Type dmaId, DMA_Channel_Cfg_Type *chCfg)
{
    uint32_t tmpVal;
    /* Get channel register */
    uint32_t DMAChs = DMA_Get_Channel(dmaAddr[dmaId], chCfg->ch);

    /* Check the parameters */
    CHECK_PARAM(IS_DMA_ID_TYPE(dmaId));
    CHECK_PARAM(IS_DMA_CHAN_TYPE(chCfg->ch));
    CHECK_PARAM(IS_DMA_TRANS_WIDTH_TYPE(chCfg->srcTransfWidth));
    CHECK_PARAM(IS_DMA_TRANS_WIDTH_TYPE(chCfg->dstTransfWidth));
    CHECK_PARAM(IS_DMA_BURST_SIZE_TYPE(chCfg->srcBurstSize));
    CHECK_PARAM(IS_DMA_BURST_SIZE_TYPE(chCfg->dstBurstSize));
    CHECK_PARAM(IS_DMA_TRANS_DIR_TYPE(chCfg->dir));
    CHECK_PARAM(IS_DMA_PERIPH_REQ_TYPE(chCfg->dstPeriph));
    CHECK_PARAM(IS_DMA_PERIPH_REQ_TYPE(chCfg->srcPeriph));

    /* Disable clock gate when use DMA0 */
    if (DMA0_ID == dmaId) {
        GLB_PER_Clock_UnGate(GLB_AHB_CLOCK_DMA_0);
    }

    /* Config channel config */
    BL_WR_REG(DMAChs, DMA_SRCADDR, chCfg->srcDmaAddr);
    BL_WR_REG(DMAChs, DMA_DSTADDR, chCfg->destDmaAddr);

    tmpVal = BL_RD_REG(DMAChs, DMA_CONTROL);
    tmpVal = BL_SET_REG_BITS_VAL(tmpVal, DMA_TRANSFERSIZE, chCfg->transfLength);
    tmpVal = BL_SET_REG_BITS_VAL(tmpVal, DMA_SWIDTH, chCfg->srcTransfWidth);
    tmpVal = BL_SET_REG_BITS_VAL(tmpVal, DMA_DWIDTH, chCfg->dstTransfWidth);
    tmpVal = BL_SET_REG_BITS_VAL(tmpVal, DMA_SBSIZE, chCfg->srcBurstSize);
    tmpVal = BL_SET_REG_BITS_VAL(tmpVal, DMA_DBSIZE, chCfg->dstBurstSize);

    tmpVal = BL_SET_REG_BITS_VAL(tmpVal, DMA_DST_ADD_MODE, chCfg->dstAddMode);
    tmpVal = BL_SET_REG_BITS_VAL(tmpVal, DMA_DST_MIN_MODE, chCfg->dstMinMode);
    tmpVal = BL_SET_REG_BITS_VAL(tmpVal, DMA_FIX_CNT, chCfg->fixCnt);

    tmpVal = BL_SET_REG_BITS_VAL(tmpVal, DMA_SI, chCfg->srcAddrInc);
    tmpVal = BL_SET_REG_BITS_VAL(tmpVal, DMA_DI, chCfg->destAddrInc);
    BL_WR_REG(DMAChs, DMA_CONTROL, tmpVal);

    tmpVal = BL_RD_REG(DMAChs, DMA_CONFIG);
    tmpVal = BL_SET_REG_BITS_VAL(tmpVal, DMA_FLOWCNTRL, chCfg->dir);
    tmpVal = BL_SET_REG_BITS_VAL(tmpVal, DMA_DSTPERIPHERAL, chCfg->dstPeriph);
    tmpVal = BL_SET_REG_BITS_VAL(tmpVal, DMA_SRCPERIPHERAL, chCfg->srcPeriph);
    BL_WR_REG(DMAChs, DMA_CONFIG, tmpVal);
}

/****************************************************************************/ /**
 * @brief  DMA set default value of all registers function
 *
 * @param  dmaId: DMA ID type
 *
 * @return SUCCESS
 *
*******************************************************************************/
void DMA_DeInit(DMA_ID_Type dmaId)
{
    switch (dmaId) {
        case DMA0_ID:
            GLB_AHB_MCU_Software_Reset(GLB_AHB_MCU_SW_DMA);
            break;

        default:
            break;
    }
}

/****************************************************************************/ /**
 * @brief  DMA channel update source memory address and len
 *
 * @param  dmaId: DMA ID type
 * @param  ch: DMA channel
 * @param  memAddr: source memoty address
 * @param  len: source memory data length
 *
 * @return None
 *
*******************************************************************************/
void DMA_Channel_Update_SrcMemcfg(DMA_ID_Type dmaId, uint8_t ch, uint32_t memAddr, uint32_t len)
{
    uint32_t tmpVal;
    /* Get channel register */
    uint32_t DMAChs = DMA_Get_Channel(dmaAddr[dmaId], ch);

    /* Check the parameters */
    CHECK_PARAM(IS_DMA_ID_TYPE(dmaId));
    CHECK_PARAM(IS_DMA_CHAN_TYPE(ch));

    /* config channel config*/
    BL_WR_REG(DMAChs, DMA_SRCADDR, memAddr);
    tmpVal = BL_RD_REG(DMAChs, DMA_CONTROL);
    tmpVal = BL_SET_REG_BITS_VAL(tmpVal, DMA_TRANSFERSIZE, len);
    BL_WR_REG(DMAChs, DMA_CONTROL, tmpVal);
}

/****************************************************************************/ /**
 * @brief  DMA channel update destination memory address and len
 *
 * @param  dmaId: DMA ID type
 * @param  ch: DMA channel
 * @param  memAddr: destination memoty address
 * @param  len: destination memory data length
 *
 * @return None
 *
*******************************************************************************/
void DMA_Channel_Update_DstMemcfg(DMA_ID_Type dmaId, uint8_t ch, uint32_t memAddr, uint32_t len)
{
    uint32_t tmpVal;
    /* Get channel register */
    uint32_t DMAChs = DMA_Get_Channel(dmaAddr[dmaId], ch);

    /* Check the parameters */
    CHECK_PARAM(IS_DMA_ID_TYPE(dmaId));
    CHECK_PARAM(IS_DMA_CHAN_TYPE(ch));

    /* config channel config*/
    BL_WR_REG(DMAChs, DMA_DSTADDR, memAddr);
    tmpVal = BL_RD_REG(DMAChs, DMA_CONTROL);
    tmpVal = BL_SET_REG_BITS_VAL(tmpVal, DMA_TRANSFERSIZE, len);
    BL_WR_REG(DMAChs, DMA_CONTROL, tmpVal);
}

/****************************************************************************/ /**
 * @brief  Get DMA channel tranfersize
 *
 * @param  dmaId: DMA ID type
 * @param  ch: DMA channel
 *
 * @return tranfersize size
 *
*******************************************************************************/
uint32_t DMA_Channel_TranferSize(DMA_ID_Type dmaId, uint8_t ch)
{
    /* Get channel register */
    uint32_t DMAChs = DMA_Get_Channel(dmaAddr[dmaId], ch);

    /* Check the parameters */
    CHECK_PARAM(IS_DMA_ID_TYPE(dmaId));
    CHECK_PARAM(IS_DMA_CHAN_TYPE(ch));

